import pytest

from module import WebScraper as WebScraper
from module import requestLink as RequestLink
from main import some_helper
from bs4 import BeautifulSoup


@pytest.fixture
def web_scraper():
    scraper = WebScraper('https://igicheva.wordpress.com/all-posts/')
    return scraper


def test_requestLink():
    test_url = 'https://igicheva.wordpress.com/all-posts/'
    test_links = ['https://igicheva.wordpress.com/2021/06/09/misteriyata-v-sinia-ekspres-ot-agata-kristi/',
                  'https://igicheva.wordpress.com/2021/05/26/klanitsa-5-ot-kart-vonegat/']
    test_articles = RequestLink(test_url)
    assert test_articles[0:2] == test_links


def test_requestContent():
    scraper = WebScraper('https://igicheva.wordpress.com/all-posts/')
    test_soup = scraper.requestContent(
        'https://igicheva.wordpress.com/2021/06/09/misteriyata-v-sinia-ekspres-ot-agata-kristi/')
    assert isinstance(type(test_soup), type(BeautifulSoup)) == True
    assert test_soup is not None


def test_FillData():
    scraper = WebScraper('https://igicheva.wordpress.com/all-posts/')
    test_link = scraper.fillData(RequestLink('https://igicheva.wordpress.com/all-posts/'))
    test_articleList = []
    test_articleList.append(test_link)
    assert test_articleList is not None


def test_parse():
    scraper = WebScraper('https://igicheva.wordpress.com/all-posts/')
    test_link = scraper.requestContent(
        'https://igicheva.wordpress.com/2021/06/09/misteriyata-v-sinia-ekspres-ot-agata-kristi/')
    test_article = scraper.parse(test_link)
    test_output = {
        "title": "“Мистерията в “Синия експрес” от Агата Кристи",
        "date": "09/06/2021",
        "content": "“Човек не бива да умира във влак.”Отново дойде ред на книга на Агата Кристи покрай "
                   "предизвикателството #ReadChristie2021 и този път избрах “Мистерията в “Синия експрес”.Дъщерята на "
                   "американския милионер Руфъс Ван Олдин Рут Кетринг е убита по време на пътуване в “Синия експрес”, "
                   "а много ценни рубини са откраднати. Само малцина знаят за скъпоценностите, така че кръгът на "
                   "заподозрени се стеснява. Вниманието на полицията се насочва към отчуждения съпруг на Рут – Дерик, "
                   "който има финансови затруднения, а ако се случи нещо на съпругата му, ще получи голямо "
                   "наследство. Но Еркюл Поаро не е съвсем убеден в точно тези мотиви за убийството…В много отношения "
                   "това е типична мистерия с Еркюл Поаро в центъра – множество особени герои, които са обвързани "
                   "един с друг, тайни, убийство и редица заподозрени. Но от друга страна това е книга за самите "
                   "участници в нея – ние вече знаем историите им много преди да се появи белгийският детектив. Това "
                   "носи различно усещане, тъй като в повечето книги на Кристи разбираме за живота на персонажите "
                   "едва след като разследването започне.В случая на “Мистерията в “Синия експрес” ми направи "
                   "впечатление, че писателката много успешно експлоатира набор от теми, върху които се гради "
                   "престъплението. Сега това беше идеята за брак, основан на пари – Рут Ван Олдин е наследствена "
                   "милионерка, която не се омъжва за човека, когото обича, а за избраника на баща си – Дерик "
                   "Кетринг. От своя страна, той ще придобие титлата “лорд” в бъдеще, но финансовите му затруднения "
                   "са известни на всички. И двамата поддържат брака си само за пред хората, но имат и странични "
                   "връзки. Именно любовницата на Дерик – Мирел, му дава идеята, че ако се случи нещо с Рут, "
                   "той ще наследи много пари. Всичко това обаче е предшествано с настояване за развод от страна на "
                   "Ван Олдин и с факта, че г-жа Кетринг е подновила старата си любов с граф де ла Рош и предприема "
                   "пътуването си със “Синия експрес” именно, за да се срещне с него. Но големият въпрос остава – кой "
                   "би могъл да убие Рут Кетринг?Разказана от трето лице, книгата е заинтригуваща, защото сюжетът е "
                   "изпълнен с действие и интересни съвпадения – Дерик Кетринг е бил във влака по време на "
                   "престъплението, граф де ла Рош е обикновен мошеник, който омайва жените и се възползва от техните "
                   "финансови възможности, мис Кейтрин Грей е пътничката във влака, която последна вижда Рут жива, "
                   "Руфъс Ван Олдин купува безценните рубини незаконно и новината се разчува в криминалните кръгове. "
                   "Но нещото, което не ми харесва в книгите на Агата Кристи е как почти винаги, по случайност, "
                   "Еркюл Поаро е на правилното място в правилното време. И тук отново той е просто пътник във влака, "
                   "когато е извършено престъплението и започва да помага на местната полиция. Истината е, "
                   "че не е лесно за читателя дори да се опита да отгатне какво се е случило, тъй като Кристи "
                   "умишлено го насочва в погрешни посоки – предубеденост на разследващите, възрастен търговец на "
                   "антики, които е известен с дискретност и способността да купува и продава крадени исторически "
                   "ценности, отхвърлен съпруг, който е загубен без жена си, изоставената любовница Мирел, "
                   "която иска да отмъсти на Дерик и появата на изкусния крадец Маркиза. И все пак знаеш, "
                   "че всичко това е прекалено очевидно, така че не се лъжете – в основата са безценните рубини. "
                   "Въпросът е кой, защо и как ги е откраднал – дали убиецът е използвал спирките на влака, "
                   "за да се качи на него, дали е пътувал в експреса през цялото време, как точно е научил за "
                   "скъпоценните камъни, защо изобщо Рут пътува с тях?Ролята на Поаро е именно това – да проследи "
                   "всички възможни сценарии вместо читателя и да подреди парчетата от пъзела, елиминирайки "
                   "неоснователните мотиви. В случая на тази книга, той решава да действа в тандем с Кейтрин Грей – "
                   "сдържана и възпитана (в книгата се споменава, че е тридесет и няколко годишна и неомъжена, "
                   "което по тогавашните стандарти си е стара мома), която получава наследство от възрастната дама, "
                   "за която се е грижела, и по стечение на обстоятелствата е основният свидетел. Не само че мис Грей "
                   "разговаря с Рут Кетринг преди да бъде убита, а и през нощта вижда мъж да влиза в каютата на "
                   "богата наследничка. За момент, може би, лутането на най-великия детектив измежду всички замесени "
                   "ще ви отегчи, но ако сте чели и преди книга от първата дама на криминалния жанр, знаете, "
                   "че той винаги открива отговорите и ги запазва за накрая. Но, в увереността на собствените си "
                   "способности, Поаро отхвърля предчувствията и любопитно метафизично преживяване на госпожица Грей, "
                   "което подсказва за убиеца. А той е пред очите ни през цялото време, макар да не е този, "
                   "за когото се представя.Ако трябва да съм напълно честна, “Мистерията в “Синия експрес” определено "
                   "не е най-добрата книга на Агата Кристи. Самата тя казва, че я мрази според “Агата Кристи. "
                   "Автобиография” (изд. Гнездото, 2021), тъй като я пише след редица злощастни събития – смъртта на "
                   "майка ѝ, развода с Арчибалд Кристи и 10-дневното изчезване на писателката. Разбира се, "
                   "не всяка книга на даден автор е майсторско произведение, но все пак Агата Кристи несъмнено си е "
                   "заслужила славата и до ден днешен. "
    }
    assert test_article == test_output
    assert isinstance(type(test_article), type(dict)) == True


def test_output():
    scraper = WebScraper('https://igicheva.wordpress.com/all-posts/')
    # test_link = scraper.requestContent(
    #     'https://igicheva.wordpress.com/2021/06/09/misteriyata-v-sinia-ekspres-ot-agata-kristi/')
    # test_article = scraper.parse(test_link)
    # test_fileObject = scraper.output()
    assert scraper.output() is not FileNotFoundError


def test_webScraperClass(web_scraper):
    assert isinstance(web_scraper, WebScraper)
    assert web_scraper.scraper == WebScraper


def test_someFixture(some_fixture):
    assert some_fixture is not None


@pytest.mark.parametrize("input_arg", ["hi", "bye"])
def test_someHelper(input_arg):
    assert some_helper(input_arg) == f"I repeat: {input_arg}"
